// Напиши всі можливі варіанти створення функцій.

function showMessage() {
    alert( 'Объявление функции' );
  }
  
  showMessage();

  
// Створи функцію, яка буде виводити кількість переданих їй аргументів.

// Напиши функцію, яка приймає 2 числа і повертає :
// -1, якщо перше число менше, ніж друге; 
// 1 - якщо перше число більше, ніж друге; 
// 0 - якщо числа рівні.

// Напиши функцію, яка обчислює факторіал переданого їй числа.

// Напиши функцію, яка приймає три окремі цифри і перетворює їх в одне число. Наприклад: цифри 1, 4, 9 перетворяться в число 149.

// Напиши функцію, яка приймає довжину і ширину прямокутника і обчислює його площу. Якщо в функцію передали 1 параметр, то вона обчислює площу квадрата.