// Мінімум
// Створи HTML-файл, в ньому пропиши всі можливі способи використання JS;
// Тобі потрібно зберігати ім’я та прізвище в змінній, придумай до 4-х імен змінних, що потрібні тобі для даної задачі. Також напиши до 5 неправильних імен (неправильні імена повинні бути закоментовані);
// Вкажи всі можливі способи коментування коду;
// Які стилі написання імен змінних ти знаєш?

/* 
Варианты записи переменных:

let myName = 'Nata';
*/

// myName = 'Nata';

// var myName = 'Nata'; 

// const myName = 'Nataliya Cherkashina';

// Норма
// Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”;
let yourName = prompt('Ваше имя?');
alert(`Hello, ${yourName}`); 

// Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;
const currentYear = '2022';
let yourBirthYear = prompt('Ваш год рождения?');
alert(`Ваш возраст: ${currentYear - yourBirthYear}`);

// Запитай рік народження користувача, порахуй його/її вік і виведи результат. Поточний рік вкажи в коді як константу;
let  sideLength = prompt('Укажите длину стороны квадрата:');
alert(`Периметр квадрата равен: ${sideLength * 4}`); 

// Максимум
// Запитай у користувача радіус кола і виведи площу такої окружності.
let circleRadius = prompt('Укажите радиус круга:');
alert(3.14 * (circleRadius * circleRadius));
